Расчетные_задачи_занятие_5/src/ChartsOfCalculationTypes/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Больничный</name>
      <description>Больничный</description>
    </items>
    <items>
      <name>ОкладНаВыезде</name>
      <description>Оклад на выезде</description>
    </items>
    <items>
      <name>ОкладПоДням</name>
      <description>Оклад по дням</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетОтработанногоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетСбораБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетДанныеГрафика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

Расчетные_задачи_занятие_5/src/ChartsOfCalculationTypes/ОсновныеНачисления/Forms/ФормаВидаРасчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеВидимостьюЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетСбораБазыПриИзменении(Элемент)
	
	УправлениеВидимостьюЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетДанныеГрафикаПриИзменении(Элемент)
	
	УправлениеВидимостьюЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюЭлементов()

	Элементы.ГруппаБазовыеВидыРасчета.Видимость = Объект.ТребуетСбораБазы;
	Элементы.ГруппаВедущиеВидыРасчета.Видимость = (Объект.ТребуетСбораБазы Или Объект.ТребуетДанныеГрафика);
	Элементы.ГруппаВытесняющиеВидыРасчета.Видимость = Объект.ТребуетДанныеГрафика;
	
	Элементы.ЗачетОтработанногоВремени.Видимость = Объект.ТребуетДанныеГрафика;
	
	Элементы.ГруппаФормула.Видимость = Объект.СпособРасчета = Перечисления.СпособыРасчета.ПоФормуле;
	
КонецПроцедуры


&НаКлиенте
Процедура СпособРасчетаПриИзменении(Элемент)
	
	Если Объект.СпособРасчета = ПредопределенноеЗначение("Перечисление.СпособыРасчета.ПоФормуле") Тогда
	
		Элементы.ГруппаФормула.Видимость = Истина;
	Иначе 
		Элементы.ГруппаФормула.Видимость = Ложь;
		
	
	КонецЕсли;
	
КонецПроцедуры
